Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринтерПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипыWebServiceОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыWebServiceОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьЦенникиВКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерОборудованияСервисыПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполнения структуры настроек при выгрузке методом GetSettings web-сервиса EquipmentService
// так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline.
// Для заполнения используются подготовленные пустые структуры получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер.
// 
Процедура ЗаполнитьНастройкиУстройства(ИДУстройства, Настройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.ПравилоОбмена
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ИдентификаторWebСервисОборудования = &ИдентификаторWebСервисОборудования
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование)";
	
	Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", ИДУстройства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоОбмена = Выборка.ПравилоОбмена;
	ПодключаемоеОборудованиеOfflineВызовСервера.ЗаполнитьСтруктуруНастроекПоПравилуОбмена(Настройки, ПравилоОбмена);
	
КонецПроцедуры

//Процедура заполнения структуры товара при выгрузке методом GetGood web-сервиса EquipmentService
//
Процедура ЗагрузитьТовар (ИДУстройства, СтруктураТовара, Штрихкод) Экспорт
	
	ТолькоИзмененные = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ИдентификаторWebСервисОборудования = &ИдентификаторWebСервисОборудования
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование)";
	
	Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", ИДУстройства);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьПараметрыУстройства(Выборка.Ссылка);
	Параметры.Вставить("ЧастичнаяВыгрузка", ТолькоИзмененные);
	
	ТаблицаТоваров = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьТоварыКВыгрузкеПоШтрихкоду(Выборка.Ссылка, Параметры, Штрихкод);
	
	ПодключаемоеОборудованиеOfflineВызовСервера.ЗаполнитьСтруктуруПрайсЛистаИзДанныхКВыгрузке(СтруктураТовара, ТаблицаТоваров);
	
КонецПроцедуры

// Процедура заполнения структуры прайс-листа при выгрузке методом GetPriceList web-сервиса EquipmentService
// так же используется при выгрузке на ККМ Offline при использовании драйвера 1С:ККМ Offline.
// Для заполнения используются подготовленные пустые структуры получаемые функциями из модуля МенеджерОборудованияСервисыКлиентСервер.
// 
Процедура ЗаполнитьПрайсЛист(ИДУстройства, СтруктураПрайсЛиста) Экспорт
	
	ТолькоИзмененные = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ИдентификаторWebСервисОборудования = &ИдентификаторWebСервисОборудования
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование)";
	
	Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", ИДУстройства);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьПараметрыУстройства(Выборка.Ссылка);
	Параметры.Вставить("ЧастичнаяВыгрузка", ТолькоИзмененные);
	ТаблицаТоваров = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьТоварыКВыгрузке(Выборка.Ссылка, Параметры);
	
	ПодключаемоеОборудованиеOfflineВызовСервера.ЗаполнитьСтруктуруПрайсЛистаИзДанныхКВыгрузке(СтруктураПрайсЛиста, ТаблицаТоваров);
	
КонецПроцедуры

// Процедура заполнения ответа web-сервиса EquipmentService на вызов метода PostDocs.
// В процедуру, через параметр "Документы", передается структура принимаемых документов.
// 
Процедура ЗагрузитьДокумент(ИДУстройства, СтруктураОтвета, СтруктураДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется
	|	И ПодключаемоеОборудование.ИдентификаторWebСервисОборудования = &ИдентификаторWebСервисОборудования
	|	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.WebСервисОборудование)";
	
	Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", ИДУстройства);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Устройство = Выборка.Ссылка;
	
	Если СтруктураДокументов.ТипДокумента = "ОтчетОПродажах" Тогда
		
		МассивДокументов = ПодключаемоеОборудованиеOfflineВызовСервера.ПриЗагрузкеОтчетаОРозничныхПродажах(Выборка.Ссылка, СтруктураДокументов.Документы, Истина);
		
		Если МассивДокументов = Неопределено Тогда
			СтруктураОтвета.Успешно = Ложь;
			СтруктураОтвета.Описание = НСтр("ru = 'Ошибка загрузки. Принимающая сторона не смогла обработать принятый отчет.'");
		Иначе
			СтруктураОтвета.Успешно = Истина;
			СтруктураОтвета.Описание = НСтр("ru = 'Загружено отчетов о продажах:'") + " " + МассивДокументов.Количество();
		КонецЕсли;
		
	ИначеЕсли СтруктураДокументов.ТипДокумента = "ОтчетОЦенниках" Тогда 
		
		Если Устройство.СохранятьЦенникиВКонфигурации Тогда
			
			ВыполненоУспешно = Ложь;
			
			ПодключаемоеОборудованиеOfflineВызовСервера.ЗагрузитьЦенники(Выборка.Ссылка, СтруктураДокументов, ВыполненоУспешно); 
			
			Если ВыполненоУспешно = Ложь Тогда
				СтруктураОтвета.Успешно = Ложь;
				СтруктураОтвета.Описание = "Ошибка загрузки. Принимающая сторона не смогла обработать принятый отчет";
			Иначе
				СтруктураОтвета.Успешно = Истина;
				СтруктураОтвета.Описание = "Ценники загружены";
			КонецЕсли;
			
		Иначе
			
			МассивСозданныхДокументов = Новый Массив;
			
			Для Каждого Документ ИЗ СтруктураДокументов.Документы Цикл
			
				Товары = Новый ТаблицаЗначений;
				Товары.Колонки.Добавить("Номенклатура");
				Товары.Колонки.Добавить("Характеристика");
				Товары.Колонки.Добавить("Упаковка");
				Товары.Колонки.Добавить("Штрихкод");
				Товары.Колонки.Добавить("КоличествоЦенников");
				
				ДанныеОТоваре = Новый Структура;
				
				Для Каждого Строка Из Документ.Товары Цикл
					
					ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьДанныеОТоваре(Строка, ДанныеОТоваре);
					СтрокаТовар = Товары.Добавить();
					СтрокаТовар.Номенклатура =       ДанныеОТоваре.Номенклатура;
					СтрокаТовар.Характеристика =     ДанныеОТоваре.Характеристика;
					СтрокаТовар.Упаковка =           ДанныеОТоваре.Упаковка;
					СтрокаТовар.Штрихкод =           Строка.Штрихкод;
					
				КонецЦикла;
				
			КонецЦикла;
			Результат = УправлениеПечатьюРТ.ПечатьЦенников(Товары, Устройство);
			СтруктураОтвета.Успешно = Истина;
			СтруктураОтвета.Описание = "Ценники распечатаны";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполнения массива типов документов, поддерживаемых конфигурацией.
// Вызывается методом GetDocTypes web-сервиса EquipmentService.
// 
Процедура ЗаполнитьТипыДокументов(МассивТипов) Экспорт
	
	ТипОтчетОПродажах = МенеджерОборудованияСервисыКлиентСервер.ПолучитьСтруктуруЗаписиМассиваТиповДокументов();
	ТипОтчетОПродажах.ТипДокумента   = "SalesReport";
	ТипОтчетОПродажах.МожноПолучать  = Ложь;
	ТипОтчетОПродажах.МожноЗагружать = Истина;
	
	МассивТипов.Добавить(ТипОтчетОПродажах);
	
КонецПроцедуры

#КонецОбласти
